# INFORMACIÓN DEL PROYECTO

EL GRADO DE EDUCACION DE UNA POBLACION AFECTA AL BIENESTAR ECONOMICO Y SOCIAL?

In [2]:
#TITULO
titulo = "EL GRADO DE EDUCACION DE UNA POBLACION AFECTA AL BIENESTAR ECONOMICO Y SOCIAL?"

## TEMA

##### En esta proyecto analizaremos variables como indice de homicidios, pbi per capita, nivel de educacion de la poblacion, indice de desarrollo humano, porcentaje de desemplo, tasa dde pobreza y veremos como cada una de ellas estan relacionadas entre si

In [3]:
# TEMA DEL PROYECTO
tema = """En esta proyecto analizaremos variables como indice de homicidios, pbi per capita, nivel de educacion de la poblacion, indice de desarrollo humano, porcentaje de desemplo
, tasa dde pobreza y veremos como cada una de ellas estan relacionadas entre si"""

## HIPÓTESIS

Define aquí lo que será la hipótesis de tu proyecto.
Deberás tener más de una, pero tu proyecto lo harás teniendo una principal hipótesis.

### HIPOTESIS GENERAL: 
#### "¿En una sociedad con mayor nivel de analfabetismo hay mayor indice de delitos? "

In [4]:
# HIPOTESIS GENERAL
hipotesis_1 = "Una sociedad mas analfabeta genera mayor indice de delitos en la misma?"

### HIPOTESIS ALTERNATIVAS
#### -Un mayor grado de educacion provoca un aumento en el PBI per capita
#### -Mientras menos rica sea la poblacion y menor grado de educacion tengan, mayor indice de homicidios habra
#### -Un mayor grado de educacion esta relacionado con un menor grado de desempleo
#### -Un mayor indice de desarrollo humano provoca que la pobreza sea menor

In [5]:
# HIPOTESIS ALTERNATIVAS
hipotesis_2 = "Un mayor grado de educacion provoca un aumento en el PBI per capita"
hipotesis_3 = "Mientras menos rica sea la poblacion y menor grado de educacion tengan, mayor indice de homicidios habra"
hipotesis_4 = "Un mayor grado de educacion esta relacionado con un menor grado de desempleo"
hipotesis_5 = "Un mayor indice de desarrollo humano provoca que la pobreza sea menor"

## OBTENCIÓN DE LOS DATOS

### DATASETS Y FUENTES ALTERNATIVAS DE DATOS

Incluye aquí una vista del dataset o datasets de los que partirás para poder evaluar tu hipótesis. <br>
También incluye el origen de estos datos y su fuente.

In [6]:
import pandas as pd

#DATASETS Y SU FUENTE
df_1 = pd.read_csv('delitos.csv')
fuente_1 = "http://data.un.org/default.aspx"

df_2 = pd.read_csv('poblacion.csv')
fuente_2 = "http://data.un.org/default.aspx"

df_3 = pd.read_csv('pbi.csv')
fuente_3 = "https://ourworldindata.org/grapher/gdp-per-capita-worldbank"

df_4 = pd.read_csv('desempleo.csv')
fuente_4 = "http://data.un.org/default.aspx"

df_5 = pd.read_csv('idh.csv')
fuente_5 = "https://ourworldindata.org/human-development-index"

#Tasa de pobreza:
fuente_6 = "https://en.wikipedia.org/wiki/List_of_sovereign_states_by_percentage_of_population_living_in_poverty"

Muestra mediante un head() los principales datasets con los que vas a trabajar

In [7]:
# Primer dataset
df_1.head()

,T13,Intentional homicides and other crimes,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,Region/Country/Area,NaN,Year,Series,Value,Footnotes,Source
1,1,"Total, all countries or areas",2005,"Intentional homicide rates per 100,000",6.3,Estimate.,United Nations Office on Drugs and Crime (UNOD...
2,1,"Total, all countries or areas",2005,Percentage of male and female intentional homi...,10.1,Estimate.,United Nations Office on Drugs and Crime (UNOD...
3,1,"Total, all countries or areas",2005,Percentage of male and female intentional homi...,2.4,Estimate.,United Nations Office on Drugs and Crime (UNOD...
4,1,"Total, all countries or areas",2010,"Intentional homicide rates per 100,000",6.1,Estimate.,United Nations Office on Drugs and Crime (UNOD...

In [8]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4866 entries, 0 to 4865
Data columns (total 7 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   T13                                     4866 non-null   object
 1   Intentional homicides and other crimes  4865 non-null   object
 2   Unnamed: 2                              4866 non-null   object
 3   Unnamed: 3                              4866 non-null   object
 4   Unnamed: 4                              4866 non-null   object
 5   Unnamed: 5                              217 non-null    object
 6   Unnamed: 6                              4866 non-null   object
dtypes: object(7)
memory usage: 266.2+ KB

In [9]:
# Segundo dataset
df_2.head()

,T08,"Enrolment in primary, secondary and tertiary education levels",Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,Region/Country/Area,NaN,Year,Series,Value,Footnotes,Source
1,1,"Total, all countries or areas",2005,Students enrolled in primary education (thousa...,"679,014",NaN,"United Nations Educational, Scientific and Cul..."
2,1,"Total, all countries or areas",2005,Gross enrollment ratio - Primary (male),104.5,NaN,"United Nations Educational, Scientific and Cul..."
3,1,"Total, all countries or areas",2005,Gross enrollment ratio - Primary (female),99.7,NaN,"United Nations Educational, Scientific and Cul..."
4,1,"Total, all countries or areas",2005,Students enrolled in secondary education (thou...,"509,277",NaN,"United Nations Educational, Scientific and Cul..."

In [10]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7283 entries, 0 to 7282
Data columns (total 7 columns):
 #   Column                                                         Non-Null Count  Dtype
---  ------                                                         --------------  -----
 0   T08                                                            7283 non-null   object
 1   Enrolment in primary, secondary and tertiary education levels  7282 non-null   object
 2   Unnamed: 2                                                     7283 non-null   object
 3   Unnamed: 3                                                     7283 non-null   object
 4   Unnamed: 4                                                     7283 non-null   object
 5   Unnamed: 5                                                     696 non-null    object
 6   Unnamed: 6                                                     7283 non-null   object
dtypes: object(7)
memory usage: 398.4+ KB

In [11]:
# Tercer dataset
df_3.head()

,T14,Gross domestic product and gross domestic product per capita,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,Region/Country/Area,NaN,Year,Series,Value,Footnotes,Source
1,1,"Total, all countries or areas",1995,GDP in current prices (millions of US dollars),"31,247,262",NaN,"United Nations Statistics Division, New York, ..."
2,1,"Total, all countries or areas",2005,GDP in current prices (millions of US dollars),"47,730,924",NaN,"United Nations Statistics Division, New York, ..."
3,1,"Total, all countries or areas",2010,GDP in current prices (millions of US dollars),"66,461,443",NaN,"United Nations Statistics Division, New York, ..."
4,1,"Total, all countries or areas",2015,GDP in current prices (millions of US dollars),"75,133,208",NaN,"United Nations Statistics Division, New York, ..."

In [12]:
df_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6787 entries, 0 to 6786
Data columns (total 7 columns):
 #   Column                                                        Non-Null Count  Dtype
---  ------                                                        --------------  -----
 0   T14                                                           6787 non-null   object
 1   Gross domestic product and gross domestic product per capita  6786 non-null   object
 2   Unnamed: 2                                                    6787 non-null   object
 3   Unnamed: 3                                                    6787 non-null   object
 4   Unnamed: 4                                                    6787 non-null   object
 5   Unnamed: 5                                                    360 non-null    object
 6   Unnamed: 6                                                    6787 non-null   object
dtypes: object(7)
memory usage: 371.3+ KB

In [13]:
# Cuarto dataset
df_4.head()

,T18,Labour force participation and unemployment,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,Region/Country/Area,NaN,Year,Series,Value,Footnotes,Source
1,1,"Total, all countries or areas",2005,Labour force participation - Total,63.7,Estimate.,"International Labour Organization (ILO), Genev..."
2,1,"Total, all countries or areas",2005,Unemployment rate - Total,5.9,Estimate.,"International Labour Organization (ILO), Genev..."
3,1,"Total, all countries or areas",2005,Labour force participation - Male,77.0,Estimate.,"International Labour Organization (ILO), Genev..."
4,1,"Total, all countries or areas",2005,Unemployment rate - Male,5.7,Estimate.,"International Labour Organization (ILO), Genev..."

In [14]:
df_4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5476 entries, 0 to 5475
Data columns (total 7 columns):
 #   Column                                       Non-Null Count  Dtype
---  ------                                       --------------  -----
 0   T18                                          5476 non-null   object
 1   Labour force participation and unemployment  5475 non-null   object
 2   Unnamed: 2                                   5476 non-null   object
 3   Unnamed: 3                                   5476 non-null   object
 4   Unnamed: 4                                   5476 non-null   object
 5   Unnamed: 5                                   3543 non-null   object
 6   Unnamed: 6                                   5476 non-null   object
dtypes: object(7)
memory usage: 299.6+ KB

In [15]:
df_5.head()

,T27,CO2 emission estimates,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,Region/Country/Area,NaN,Year,Series,Value,Footnotes,Source
1,8,Albania,1975,Emissions (thousand metric tons of carbon diox...,"4,524",NaN,"International Energy Agency, IEA World Energy ..."
2,8,Albania,1985,Emissions (thousand metric tons of carbon diox...,"7,145",NaN,"International Energy Agency, IEA World Energy ..."
3,8,Albania,2005,Emissions (thousand metric tons of carbon diox...,"3,981",NaN,"International Energy Agency, IEA World Energy ..."
4,8,Albania,2010,Emissions (thousand metric tons of carbon diox...,"4,074",NaN,"International Energy Agency, IEA World Energy ..."

In [16]:
df_5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2203 entries, 0 to 2202
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   T27                     2203 non-null   object
 1   CO2 emission estimates  2202 non-null   object
 2   Unnamed: 2              2203 non-null   object
 3   Unnamed: 3              2203 non-null   object
 4   Unnamed: 4              2203 non-null   object
 5   Unnamed: 5              247 non-null    object
 6   Unnamed: 6              2203 non-null   object
dtypes: object(7)
memory usage: 120.6+ KB